'''
Напиши модуль, який допоможе тобі в математичних задачах, де потрібно знайти площу і периметр прямокутника.

На олімпіаді з математики виграє той, хто швидше за всіх вирішить завдання.
В одному із завдань потрібно знайти площу і периметр прямокутника. Давай напишемо програму, яка буде містити дві функції: area () - повертає площу прямокутника, perimeter () - повертає периметр прямокутника.
Напиши програму і збережи її як модуль, який допоможе тобі в наступному завданні.
'''

# Напиши функцію perimeter () для обчислення периметра

def perimeter(a,b):
    return 2*a+2*b

# Напиши функцію area () для обчислення площі

def area(a,b):
    return a*b
