'''
Підключи модуль і подивися, в яку пору року і день тижня ти народився.
Перед тобою програма, яка використовує функції season і day з попередньої програми. Підключи модуль birthday і подивися, що вийде!
'''

from birthday import*
# Програма  запитує номер місяця та друкує його назву
m = int(input("Введи номер місяця твого народження: "))
s1 = "Це - " + season(m) + "."
print(s1)
# Програма запитує номер дня тижня та друкує його назву
d = int(input("Введи номер дня тижня, коли ти народився: "))
s2 = "Це - " + day(d) + "."
print(s2)
