'''
Напиши програму для обчислення площі та периметра прямокутника.

Молодець, а тепер використай свій модуль з минулого завдання і напиши програму, яка обчислює спочатку периметр, а після - площу прямокутника. Виведи результат на екран.
'''

# Підключи модуль з попереднього завдання

from GeometryFunction import*

a = int(input("Введи першу сторону прямокутника:"))
b = int(input("Введи другу сторону прямокутника:"))

print("периметр:{P}".format(P=perimeter(a,b)))
print("площа:{S}".format(S=area(a,b)))
