"""
У грі в трьох хлопців різна кількість балів. 
Давай порахуємо, а скільки у них балів в середньому?
У програмі три рази викликається функція average з різними параметрами. 
Доповніть код визначенням функції average, 
яка мала б друкувати середнє арифметичне переданих їй параметрів.
Середнє арифметичне = сума доданків / кількість доданків


"""
def average(*numbers):
    result=0
    for number in numbers:
        result+=number
    print(result/len(numbers))

average(1, 2, 3)
average(100, 50, 3)
average(9865, 678, 665)
