'''
Програма запитує, яке місто найбільше за площею. 
Питання повторюється до отримання правильної відповіді: Ордос.
Програма повинна запитати 
"Вгадай, яке найбільше за площею місто в світі?". 
Правильна відповідь - "Ордос". 
Якщо назва міста дана вірно, програма друкує "Вгадав!". 
У разі неправильної відповіді друкує "Не вгадав! 
Є ще більше! Спробуй ще раз!" і знову пропонує ввести місто.
'''

question = "Вгадай, яке найбільше за площею місто в світі?"
right_answer = "Ордос"
yes = "Вгадав!"
no = "Не вгадав! Є ще більше! Спробуй ще раз!"

answer=""

print(question)
while not answer==right_answer:
    answer=input("answer:")
    print(yes if right_answer==answer else no)