'''
Написати функцію season, що приймає 1 параметр - номер місяця (від 1 до 12), 
і повертає час року, до якого цей місяць належить (зима, весна, літо або осінь).
Програма, яка використовує функцію season вже написана. 
Вона запитує номер місяця і друкує потрібний рядок. 
Наприклад, "Це - літо.". 
Додай в потрібне місце визначення функції season.
Функція отримує в якості свого параметра номер місяця. 
За допомогою декількох умовних операторів визначає, до якого часу року відноситься місяць. 
Після цього повертає (return) один з рядків: "зима", "весна", "літо", "осінь". 
Пори року пишуться маленькими літерами без розділових знаків.
'''

# визнач функцію season()

# програма використовує функцію, щоб вести діалог:
def season(m):
    if(m>=1 and m<=12):
        months=["січень", "лютий", "березень", "квітень", "травень", "червень", "липень", "серпень", "вересень", "жовтень", "листопад", "грудень"]
        return months[m-1]

m = int(input("Введи номер місяця твого народження: "))
s = "Це - " + season(m) + "."
print(s)
