'''
Бути вічливими це так здорово! Давай протестуємо вічливізатор нового покоління!
У програмі написана функція - вічливізатор, яка повертає рядок ", будь ласка". Використовуй цю функцію і напиши програму, яка отримує від користувача рядок, потім за допомогою функції до цього рядка додає ", будь ласка" і виводить результат на екран!
'''
from M3.compose import compose


def vvichlyvizator(s):
    return s + ", будь ласка"

vvichlyvizatorInput=compose(print,vvichlyvizator,input)
vvichlyvizatorInput("")